<div class="for_info_only" style="text-align: center">
    <img src="{{MEDIA_CONVERT}}title2.png" style="max-height: 350px">
</div>
<p>Como seguramente saben, <a href="http://en.wikipedia.org/wiki/Chess"> el ajedrez</a> es un juego antiguo para el cual casi todo el mundo que tiene al menos un conocimiento b&aacute;sico de las reglas. El ajedrez es un juego de estrategia para dos jugadores que utiliza un tablero a cuadros, dividido en ocho filas (identificadas con los n&uacute;meros 1 a 8) y ocho columnas (identificadas con letras A a H). Cada casilla (cuadro) del tablero es por Identificado un par &uacute;nico de coordenadas - una letra y un n&uacute;mero (por ejemplo, &quot;a1&quot;, &quot;h8&quot;, &quot;d6&quot;).</p>

<p>Para esta misi&oacute;n echemos un vistazo a las torres, una unidad de choque peligrosa que puede ser utilizado para un empuje r&aacute;pido o para una densa defensa. La torre se mueve horizontalmente o verticalmente, a trav&eacute;s de cualquier n&uacute;mero de casillas no ocupadas, pero no puede saltar sobre otras piezas. La captura, como con cualquier otra unidad, se produce mediante la ocupaci&oacute;n de la casilla en la que la pieza del enemigo se sit&uacute;a.</p>

<p>Para esta misi&oacute;n tienes una torre enfrentando un ej&eacute;rcito de torres enemigas. La torre s&oacute;lo puede moverse si dicho movimiento conlleva la captura de una unidad enemiga. De esta forma, en cada turno nuestra torre se mover&aacute; y capturar&aacute; hasta que no quede ning&uacute;n enemigo, para enseguida tomar un paso &quot;vac&iacute;o&quot; y detenerse.</p>

<p>Se te informara la posici&oacute;n de tu torre (<em>berserk rook</em>) y las posiciones de las torres enemigas. Tu objetivo es capturar el mayor n&uacute;mero de unidades posibles sin detenerse. Cada movimiento de tu respuesta debe capturar una unidad enemiga. El resultado ser&aacute; el m&aacute;ximo n&uacute;mero de torres enemigas capturadas.</p>

<p style="text-align: center;"><img class="for_info_only" title="rooks" src="{{MEDIA}}rooks.png" alt="rooks" style="max-height: 300px" /></p>

<p><strong>Datos de Entrada: </strong> Dos argumentos. Posici&oacute;n de tu torre (<em>berserk rook</em>) como una cadena (<em>str</em>), y las posiciones de las torres enemigas, como un set de cadenas (<em>str</em>).</p>

<p><strong>Salida: </strong> El m&aacute;ximo n&uacute;mero de torres enemigas capturadas, como un entero (<em>int</em>).</p>

<div class="for_info_only">
<p><strong>Ejemplo:</strong></p>

    <pre class="brush: python">{% if interpreter.slug == "js-node" %}
berserkRook(u'd3', {u'd6', u'b6', u'c8', u'g4', u'b8', u'g6'}) == 5
berserkRook(u'a2', {u'f6', u'f2', u'a6', u'f8', u'h8', u'h6'}) == 6
berserkRook(u'a2', {u'f6', u'f8', u'f2', u'a6', u'h6'}) == 4
{% else %}
berserk_rook(u'd3', {u'd6', u'b6', u'c8', u'g4', u'b8', u'g6'}) == 5
berserk_rook(u'a2', {u'f6', u'f2', u'a6', u'f8', u'h8', u'h6'}) == 6
berserk_rook(u'a2', {u'f6', u'f8', u'f2', u'a6', u'h6'}) == 4
{% endif %}</pre>
</div>

<p class="for_info_only"><strong>&iquest;C&oacute;mo se usa?: </strong> Para cualquier ajedrez y casi cualquier otro juego es importante pensar varios pasos en el futuro. Aqu&iacute; hemos creado una situaci&oacute;n simple que ilustra este concepto. La idea b&aacute;sica es pensar en problemas de optimizaci&oacute;n utilizando modelos.</p>

<p><strong>Condiciones:</strong><br />
0 &lt; enemigos &le; 8</p>
